const quizQuestions = [
    {
        question: "1985-ലെ നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആൻഡ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്റ്റിലെ സെക്ഷൻ 31 എ പ്രകാരമുള്ള വധശിക്ഷ ഏതൊക്കെ കുറ്റങ്ങൾക്കാണ് ബാധകമാണ്?",
        options: ["സെക്ഷൻസ് 19, 24, 27 എ", "സെക്ഷൻസ് 18, 24, 27 എ", "സെക്ഷൻസ് 19, 25, 27 എ", "സെക്ഷൻസ് 19, 24, 27 ബി"],
        correct: 0
    },
    {
        question: "എൻ.ഡി.പി.എസ് നിയമം ആർക്കെല്ലാം ബാധകം ആകും?",
        options: ["ഇന്ത്യയ്ക്ക് പുറത്തുള്ള ഏതൊരു വ്യക്തിക്കും", "ഇന്ത്യയ്ക്ക് പുറത്തുള്ള ഏതൊരു ഇന്ത്യൻ പൗരനും", "ലോകത്ത് എവിടെയും രജിസ്റ്റർ ചെയ്തിട്ടുള്ള ഏതൊരു കപ്പലോ വിമാനമോ", "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"],
        correct: 1
    },
    {
        question: "ചുവടെ കൊടുത്തിരിക്കുന്നവയിൽ എൻ.ഡി.പി.എസ് നിയമം, 1985 പ്രകാരമുള്ള ശരിയായ പ്രസ്താവന ഏത്? i) ഇന്ത്യ മുഴുവൻ ഈ നിയമം ബാധകമാണ്. ii) ഇന്ത്യയിൽ രജിസ്റ്റർ ചെയ്തിട്ടുള്ള കപ്പലുകളിലും വിമാനങ്ങളിലുമുള്ള എല്ലാ വ്യക്തികൾക്കും ഈ നിയമം ബാധകമാണ്. iii) മറ്റു രാജ്യങ്ങളിൽ താമസിക്കുന്ന ഇന്ത്യൻ പൗരന്മാർക്ക് ഈ നിയമം ബാധകമാണ്.",
        options: ["i, ii", "ii, iii", "i, iii", "i, ii, iii"],
        correct: 3
    },
    {
        question: "1985-ലെ NDPS നിയമത്തിന് കീഴിലുള്ള കുറ്റകൃത്യങ്ങളുടെ വ്യവസ്ഥകൾ എപ്രകാരമാണ്?",
        options: ["പോലീസിന് നേരിട്ട് കൊടുക്കാവുന്നതും ജാമ്യം ലഭിക്കുന്നതും", "പോലീസിന് നേരിട്ട് കൊടുക്കാവുന്നതും ജാമ്യം ലഭിക്കാത്തതും", "പോലീസിന് നേരിട്ട് കൊടുക്കാൻ കഴിയാത്തതും ജാമ്യം ലഭിക്കുന്നതും", "പോലീസിന് നേരിട്ട് കൊടുക്കാൻ കഴിയാത്തതും ജാമ്യം ലഭിക്കാത്തതും"],
        correct: 1
    },
    {
        question: "എൻ.ഡി.പി.എസ് നിയമപ്രകാരം, ഒരു വ്യക്തി മനഃപൂർവ്വം തന്റെ വീട്ടിൽ മയക്കുമരുന്ന് സൂക്ഷിക്കാൻ അനുവദിച്ചാൽ നിയമപരമായി എന്ത് സംഭവിക്കും?",
        options: ["മയക്കുമരുന്ന് വ്യക്തിഗത ഉപയോഗത്തിനുള്ളതല്ലെങ്കിൽ അവർ ബാധ്യസ്ഥരല്ല", "വകുപ്പ് 27 പ്രകാരം അവർക്കെതിരെ കേസെടുക്കാം", "മയക്കുമരുന്ന് കുറ്റകൃത്യത്തിനായി പരിസരം ഉപയോഗിക്കാൻ അനുവദിച്ചതിന് വകുപ്പ് 25 പ്രകാരം അവർ ബാധ്യസ്ഥരാണ്.", "സ്വത്തിന്റെ ഉടമയാണെങ്കിൽ മാത്രമേ അവർ ബാധ്യസ്ഥരാകൂ."],
        correct: 2
    },
    {
        question: "ഇനിപ്പറയുന്ന സാഹചര്യങ്ങളിൽ ഏതാണ് NDPS ആക്ടിന്റെ വകുപ്പ് 31A ചുമത്താൻ സാധ്യതയുള്ളത്?",
        options: ["വ്യക്തിഗത ഉപയോഗത്തിനായി ആദ്യമായി ചെറിയ അളവിൽ സൈക്കോട്രോപിക് വസ്തുക്കളുടെ ഉപയോഗം", "ആവർത്തിച്ചുള്ള സൈക്കോട്രോപിക് വസ്തുക്കളുടെ ഉപയോഗം", "വാണിജ്യ അളവിലുള്ള മയക്കുമരുന്ന് മരുന്നുകൾ ഉൾപ്പെടുന്ന ആവർത്തിച്ചുള്ള കുറ്റകൃത്യം", "നിരോധിത വസ്തു കഴിക്കാൻ ശ്രമിച്ചു."],
        correct: 2
    },
    {
        question: "1985-ലെ നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്റ്റിലെ ഏത് വകുപ്പ് പ്രകാരമാണ് മുൻശിക്ഷയ്ക്ക് ശേഷമുള്ള കുറ്റകൃത്യങ്ങൾക്ക് വധശിക്ഷ നൽകുന്നത്?",
        options: ["സെക്ഷൻ 31A", "സെക്ഷൻ 27", "സെക്ഷൻ 31", "സെക്ഷൻ 35"],
        correct: 0
    },
    {
        question: "1985-ലെ നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്ട് പ്രകാരം ശിക്ഷാർഹമായ എല്ലാ കുറ്റങ്ങളും",
        options: ["കോഗ്നൈസബിളും ജാമ്യം ലഭിക്കാവുന്നതുമാണ്", "നോൺ കോഗ്നൈസബിളും ജാമ്യം ലഭിക്കാത്തതുമാണ്", "കോഗ്നൈസബിളും ജാമ്യം ലഭിക്കാത്തതുമാണ്", "മുകളിൽ കൊടുത്തിരിക്കുന്നതിൽ ഒന്നുമല്ല"],
        correct: 2
    },
    {
        question: "നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്ട് 1985 സെക്ഷൻ 37 പ്രകാരം ജാമ്യം ലഭിക്കുന്നതുമായി ബന്ധപ്പെട്ട് താഴെപ്പറയുന്ന വാക്യങ്ങളിൽ ഏറ്റവും ശരിയായത് തിരഞ്ഞെടുക്കുക:",
        options: ["പ്രോസിക്യൂഷന് ജാമ്യാപേക്ഷ എതിർക്കാൻ അവസരം കൊടുക്കണം", "ന്യായമായ കാരണങ്ങൾ കൊണ്ട് കോടതിക്ക് പ്രതിയുടെ നിരപരാധിത്വം ബോധ്യപ്പെടണം", "ഓപ്ഷൻസ് (a) & (b)", "ഓപ്ഷൻസ് (a) & (b) കൂടാതെ ക്രിമിനൽ പ്രോസീജർ കോഡ് (CrPC 1973) പ്രകാരമുള്ള വ്യവസ്ഥകൾ പാലിക്കണം."],
        correct: 2
    },
    {
        question: "നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്ട് 1985 പ്രകാരം ഉള്ള കുറ്റവുമായി ബന്ധപ്പെട്ടുള്ള അറസ്റ്റിന് ശേഷം എത്ര വർഷത്തിനകം നേടിയ വസ്തു കണ്ടുകെട്ടപ്പെടും?",
        options: ["5 വർഷം", "6 വർഷം", "7 വർഷം", "8 വർഷം"],
        correct: 1
    },
    {
        question: "1985-ലെ നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റാൻഡസ് ആക്ടിന്റെ സെക്ഷൻ 25 എന്താണ്?",
        options: ["കൃഷിക്കാരൻ കറുപ്പ് തെറ്റായി ഉപയോഗിച്ചതിനുള്ള ശിക്ഷ.", "ഒരു കുറ്റം ചെയ്യാൻ സ്ഥലവും മറ്റും അനുവദിച്ചതിനുള്ള ശിക്ഷ", "സൈക്കോട്രോപിക് പദാർത്ഥങ്ങളുമായി ബന്ധപ്പെട്ട ലംഘനത്തിനുള്ള ശിക്ഷ", "പോപ്പി വൈക്കോലുമായി ബന്ധപ്പെട്ട നിയമലംഘനത്തിനുള്ള ശിക്ഷ"],
        correct: 1
    },
    {
        question: "1985-ലെ നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്ടിന്റെ ഏത് വകുപ്പാണ് മുൻ ശിക്ഷയ്ക്ക് ശേഷമുള്ള കുറ്റകൃത്യങ്ങൾക്കുള്ള വർദ്ധിപ്പിച്ച ശിക്ഷയെ കുറിച്ച് പറയുന്നത്?",
        options: ["സെക്ഷൻ 37", "സെക്ഷൻ 31", "സലക്ഷൻ 34", "സെക്ഷൻ 35"],
        correct: 1
    },
    {
        question: "NDPS നിയമത്തിലെ സെക്ഷൻ 27 പ്രകാരം കൊക്കെയ്ൻ കഴിച്ചാലുള്ള ശിക്ഷ എന്താണ്?",
        options: ["1 വർഷം വരെ കഠിന തടവോ അല്ലെങ്കിൽ 10,000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ രണ്ടും", "6 മാസം വരെ കഠിന തടവോ അല്ലെങ്കിൽ 10,000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ രണ്ടും", "1 വർഷം വരെ കഠിന തടവോ അല്ലെങ്കിൽ 20,000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ രണ്ടും", "6 മാസം വരെ കഠിന തടവോ അല്ലെങ്കിൽ 20,000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ രണ്ടും"],
        correct: 2
    },
    {
        question: "NDPS ആക്ട്, 1985 സെക്ഷൻ 37 പ്രകാരം ചെയ്ത കുറ്റകൃത്യങ്ങളുടെ സ്വഭാവം",
        options: ["തിരിച്ചറിയാനാവുന്ന കുറ്റം", "തിരിച്ചറിയാനാവാത്ത കുറ്റം", "ജാമ്യം ലഭിക്കുന്നവ", "മുകളിൽ പറഞ്ഞവ ഒന്നുമല്ല"],
        correct: 0
    },
    {
        question: "നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് ആക്ട് (ഇന്ത്യ) 1985 ലെ ഏത് വകുപ്പ് പ്രകാരമാണ് കുറ്റവാളികൾക്ക് ധനസഹായം നൽകുന്നത് കുറ്റകൃത്യമാകുന്നത്?",
        options: ["വകുപ്പ് 27 (എ)", "വകുപ്പ് 28", "വകുപ്പ് 26", "വകുപ്പ് 29"],
        correct: 0
    },
    {
        question: "കൊക്കെയ്ൻ എന്ന മയക്കുമരുന്ന് ഉപയോഗിക്കുന്ന വ്യക്തികൾക്ക് ലഭിക്കുന്ന പരമാവധി തടവ് ശിക്ഷ:",
        options: ["1 വർഷം വരെ കഠിനതടവ്", "6 മാസം വരെ കഠിനതടവ്", "2 വർഷം വരെ കഠിനതടവ്", "3 വർഷം വരെ കഠിനതടവ്"],
        correct: 0
    },
    {
        question: "മയക്കുമരുന്നിന്റെ ദുരുപയോഗവും കള്ളക്കടത്തും ശിക്ഷാർഹമാക്കുന്നതിന് വേണ്ടി വന്ന പ്രത്യേക നിയമം",
        options: ["ഇന്ത്യൻ ശിക്ഷാ നിയമം", "നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് നിയമം", "നർക്കോട്ടിക് സബ്‌സ്റ്റൻസസ് ആന്റ് ഓപ്പിയം നിയന്ത്രണ നിയമം", "ഇന്ത്യൻ രാജ്യസുരക്ഷാ നിയമം"],
        correct: 1
    },
    {
        question: "വലീയ അളവിൽ മയക്കുമരുന്ന് കടത്തുന്നതിന് ആവർത്തിച്ച് ശിക്ഷ ലഭിച്ചിട്ടുള്ള വ്യക്തി, വീണ്ടും അതേ കുറ്റം ചെയ്താൽ S.31.A പ്രകാരം നർക്കോട്ടിക് ഡ്രഗ്‌സ് ആന്റ് സൈക്കോട്രോപിക് സബ്‌സ്റ്റൻസസ് നിയമത്തിൽ അനുശാസിക്കുന്ന ശിക്ഷ",
        options: ["ജീവപര്യന്തം തടവ്", "10 വർഷം വരെ കഠിന തടവ്", "വധശിക്ഷ", "7 വർഷം വരെ തടവ്"],
        correct: 2
    },
    {
        question: "കേന്ദ്ര ഗവൺമെന്റിന്റെ ഒഫീഷ്യൽ ഗസറ്റിൽ പരാമർശിച്ചിട്ടുള്ള ലഹരി പദാർത്ഥങ്ങൾ കഴിക്കുന്നതിന് എൻ.ഡി.പി.എസ്. ആക്റ്റിൽ, പറഞ്ഞിട്ടുള്ള പരമാവധി ശിക്ഷയെന്ത്?",
        options: ["ഒരു വർഷത്തെ കഠിന തടവ്", "ഒരു വർഷത്തെ സാധാരണ തടവ്", "മൂന്ന് വർഷത്തെ കഠിന തടവ്", "മൂന്ന് വർഷത്തെ സാധാരണ തടവ്"],
        correct: 0
    },
    {
        question: "Narcotic Drugs and Psychotropic Substances Act നിലവിൽ വന്നത്",
        options: ["1985 സെപ്റ്റംബർ 16", "1985 ഒക്ടോബർ 14", "1986 മാർച്ച് 17", "1985 നവംബർ 14"],
        correct: 3
    },
    {
        question: "NDPS ആക്ട് എത്ര തവണ ഭേദഗതി ചെയ്തിട്ടുണ്ട്",
        options: ["2", "3", "4", "5"],
        correct: 2
    },
    {
        question: "NDPS ആക്ടിൻ ഒപ്പുവെച്ച ഇന്ത്യൻ രാഷ്ട്രപതി",
        options: ["ഗ്യാനി സെയിൽസിംഗ്", "ആർ. വെങ്കിട്ടരാമൻ", "വി.വി. ഗിരി", "കെ.ആർ. നാരായണൻ"],
        correct: 0
    },
    {
        question: "NDPS ആക്ട് ആദ്യമായി ഭേദഗതി ചെയ്ത വർഷം",
        options: ["1987", "1988", "1989", "2000"],
        correct: 1
    },
    {
        question: "NDPS ആക്ട് രണ്ടാമത് ഭേദഗതി ചെയ്ത വർഷം",
        options: ["2000", "2001", "2002", "2004"],
        correct: 1
    },
    {
        question: "NDPS ആക്ട് മൂന്നാമത് ഭേദഗതി ചെയ്ത വർഷം",
        options: ["2011", "2012", "2013", "2014"],
        correct: 3
    },
    {
        question: "NDPS ആക്ടിൻ ഏതു വകുപ്പിലാണു മരണ ശിക്ഷ നിഷ്കർഷിച്ചിരിക്കുന്നത്",
        options: ["സെക്ഷൻ 28", "സെക്ഷൻ 31", "സെക്ഷൻ 31 A", "സെക്ഷൻ 37"],
        correct: 2
    },
    {
        question: "നർക്കോട്ടിക്സ് കൺട്രോൾ ബ്യൂറോ നിലവിൽ വന്നത്",
        options: ["1986 മാർച്ച് 17", "1986 സെപ്റ്റംബർ 16", "1986 ആഗസ്റ്റ് 23", "1986 നവംബർ 14"],
        correct: 0
    },
    {
        question: "നിയമവിരുദ്ധമായി സമ്പാദിച്ച സ്വത്ത് പിടിച്ചെടുക്കുകയോ മരവിപ്പിക്കുകയോ ചെയ്യുന്നതിനെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന NDPS ആക്റ്റിലെ വകുപ്പ്",
        options: ["സെക്ഷൻ 19", "സെക്ഷൻ 24", "സെക്ഷൻ 27 A", "സെക്ഷൻ 68F"],
        correct: 3
    },
    {
        question: "കൊക്കെയ്ൻ, മോർഫിൻ എന്നിവ ഉപയോഗിച്ചാലുള്ള ശിക്ഷയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന NDPS ആക്റ്റിലെ വകുപ്പ്",
        options: ["സെക്ഷൻ 25", "സെക്ഷൻ 27", "സെക്ഷൻ 28", "സെക്ഷൻ 31"],
        correct: 1
    },
    {
        question: "NDPS ആക്റ്റിലെ സെക്ഷൻ 27 പ്രകാരം കൊക്കെയ്ൻ, മോർഫിൻ എന്നിവ ഉപയോഗിച്ചാലുള്ള ശിക്ഷ",
        options: ["1 വർഷം വരെ കഠിനതടവോ 20,000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ ഇവ രണ്ടും", "6 മാസം തടവോ 10,000 രൂപ പിഴയോ അല്ലെങ്കിൽ ഇവ രണ്ടും", "2 മാസം തടവോ 25,000 രൂപ പിഴയോ അല്ലെങ്കിൽ ഇവ രണ്ടും", "2 വർഷം വരെ കഠിനതടവോ 5000 രൂപ വരെ പിഴയോ അല്ലെങ്കിൽ ഇവ രണ്ടും"],
        correct: 0
    },
    {
        question: "NDPS ആക്ട് പ്രകാരം ഒരു കുറ്റകൃത്യം ചെയ്യുന്നതിനായുള്ള പരിസരം ഉണ്ടാക്കിക്കൊടുത്താലുള്ള ശിക്ഷയെപ്പറ്റി പരാമർശിക്കുന്ന വകുപ്പ്",
        options: ["സെക്ഷൻ 25", "സെക്ഷൻ 31", "സെക്ഷൻ 37", "സെക്ഷൻ 68"],
        correct: 0
    }
];
